Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: Next we can see that our `serverfix` branch is tracking the `server-fix-good` branch on our `teamone` server and is ahead by three and behind by one, meaning that there is one commit on the server we haven't merged in yet and three commits locally that we haven't pushed.
cs: A dále vidíme, že naše větev `serverfix` sleduje větev `server-fix-good` na serveru `teamone`, má náskok tři a současně je pozadu o jeden, což znamená, že se na serveru nachází jeden objekt revize (commit), který jsme zatím nezačlenili (merge), a tři lokální objekty revize, které jsme zatím neodeslali (push).

source: Next, John emails Jessica to say he's pushed some changes to the `featureA` branch and asks her to verify them.
cs: John poté pošle Jessice e-mail, aby jí sdělil, že odeslal několik změn do větve `featureA`, a poprosí ji, aby je ověřila.

source: Next, move the rest of the references under `refs/remotes` to be local branches:
cs: Ze zbytku referencí vytvořte v repozitáři `refs/remotes` lokální větve:

source: Next, the person who pushed the merged work decides to go back and rebase their work instead; they do a `git push --force` to overwrite the history on the server.
cs: Jenže osoba, která odeslala výsledek sloučení, se rozhodne vrátit zpět a svou práci raději přeskládat. Provede příkaz `git push --force` a přepíše historii na serveru.

source: Next, try to make each commit a logically separate changeset.
cs: Dále se snažte provádět každý zápis (commit) jako logicky oddělený soubor změn.

source: Next, we'll cover Git's killer feature: its branching model.
cs: V další kapitole se podíváme na exkluzivní vlastnost Gitu -- na model větvení.

source: Next, we'll cover what you'll need to run your own Git repository-hosting server.
cs: V další kapitole si řekneme, co budete potřebovat, abyste mohli provozovat svůj vlastní server pro hostování gitových repozitářů.

source: Next, you have a hotfix to make.
cs: V dalším kroku máte provést opravu.

source: Next, you need to push your change upstream.
cs: Jako další krok tak chcete odeslat provedené změny do vzdáleného repozitáře.

source: No commit was completed in that instance.
cs: V takovém případě nebyla zapsána žádná revize.

source: No problems occur; as you can see it was a simple fast-forward.
cs: Nevyskytly se žádné problémy. Jak vidíte, šlo o jednoduchý posun „rychle vpřed“.

source: Normally, you get as the original commit the commit where you copied the code over, because that is the first time you touched those lines in this file.
cs: Normálně se jako původní revize zobrazí ta, kam jste kód zkopírovali, protože to bylo poprvé, kdy jste v daném souboru sáhli do těchto řádků.

source: Not nearly as many configuration options are available for the server side of Git, but there are a few interesting ones you may want to take note of.
cs: Na straně serveru není ani zdaleka tolik parametrů konfigurace jako na straně klienta, avšak několik zajímavých si jistě zaslouží vaši pozornost.

source: Not only does the Author field look a lot better, but the `git-svn-id` is no longer there, either.
cs: Nejenže teď pole Author vypadá podstatně lépe, ale navíc jste se zbavili i záznamu `git-svn-id`.

source: Note that someone must shell onto the machine and create a bare repository every time you want to add a project.
cs: Nezapomeňte, že pokaždé, když chcete vytvořit projekt, musí se k počítači někdo přihlásit a vytvořit holý repozitář.

source: Note that the snapshot pointed to by the final commit you end up with, whether it's the last of the rebased commits for a rebase or the final merge commit after a merge, is the same snapshot – it's only the history that is different.
cs: Všimněte si, že snímek, na který ukazuje poslední objekt revize -- ať už se jedná o poslední revizi vzniklou přeskládáním, nebo poslední bod sloučení po provedení `merge` --, je shodný. Liší se pouze historie.

source: Note that this is a lot different than the concept of `HEAD` in other VCSs you may be used to, such as Subversion or CVS.
cs: Poznamenejme, že tento koncept `HEAD` se velmi liší od těch, na které můžete být zvyklí z jiných systémů pro správu verzí, jako jsou Subversion nebo CVS.

source: Note that this is a project called Git for Windows, which is separate from Git itself; for more information on it, go to https://git-for-windows.github.io/[].
cs: Povšimněte si, že jde o projekt zvaný Git for Windows, který je od projektu Git oddělen. Více informací je uvedeno na stránce http://msysgit.github.io/[].

source: Note the backslash (`\`) in front of the `*`.
cs: Všimněte si zpětného lomítka (`\`) před znakem `*`.

source: Notice how you don't have to run `git add` on the ``CONTRIBUTING.md'' file in this case before you commit.
cs: Povšimněte si, že kvůli souboru `CONTRIBUTING.md` v tomto případě nemusíte před zapsáním revize provádět příkaz `git add`.

source: Notice that the first field is the partial SHA-1 of the commit that last modified that line.
cs: Všimněte si, že první pole je část hodnoty SHA-1 revize, v níž byl řádek naposled změněn.

source: Notice that the object entry points to the commit SHA-1 value that you tagged.
cs: Všimněte si, že záznam objektu ukazuje na hodnotu revize SHA-1, k níž jste značku přidali.

source: Notice that these remotes use a variety of protocols; we'll cover more about this in <<_git_on_the_server>>.
cs: Všimněte si, že tyto vzdálené repozitáře používají různé protokoly. Více se o tom zmíníme v kapitole <<_git_on_the_server>>.

source: Notice that you have to tell the command where to find your Git repositories with the `GITWEB_PROJECTROOT` variable.
cs: Všimněte si, že musíte příkazu pomocí proměnné `GITWEB_PROJECTROOT` sdělit, kde najde repozitáře Git.

source: Notice the `*` character that prefixes the `master` branch: it indicates the branch that you currently have checked out (i.e., the branch that `HEAD` points to).
cs: Všimněte si znaku `*`, který je uveden před větví `master`. Označuje větev, na kterou jste přepnuti (check out; tj. větev, na kterou ukazuje `HEAD`).

source: Notice the last line of the file, which begins with a `^`.
cs: Všimněte si také posledního řádku souboru, který začíná znakem `^`.

source: Notice the reverse order.
cs: Všimněte si, že se pořadí obrátilo.

source: Now Jessica merges in John's work (`origin/master`):
cs: Nyní Jessica začlení Johnovu práci (`origin/master`):

source: Now `CONTRIBUTING.md` is listed as both staged _and_ unstaged.
cs: Soubor `CONTRIBUTING.md` je uveden jak v části připraveno k zapsání (Changes to be committed), tak v části nepřipraveno k zapsání (Changes not staged for commit).

source: Now `origin/master` is reachable from Jessica's `master` branch, so she should be able to successfully push (assuming John hasn't pushed again in the meantime):
cs: Větev `origin/master` je dosažitelná z Jessičiny větve `master`, takže by měla být schopná práci úspěšně odeslat (za předpokladu, že John mezitím neodeslal další revizi):

source: Now all the old branches are real Git branches and all the old tags are real Git tags.
cs: Všechny staré větve jsou nyní skutečnými větvemi Git a všechny staré značky jsou nyní skutečnými značkami Git.

source: Now suppose you did that in a branch.
cs: Nyní předpokládejme, že toto vše se odehrálo ve větvi.

source: Now that you can (hopefully) determine which workflow combination may work for you, we'll cover some more specific examples of how to accomplish the main roles that make up the different flows.
cs: Teď už si (snad) dokážete vybrat, jaká kombinace by vám mohla vyhovovat. Ukážeme si pár konkrétnějších příkladů toho, jak splnit hlavní role, které různé pracovní postupy vytvářejí.

source: Now that you can specify individual commits, let’s see how to specify ranges of commits.
cs: Nyní, když umíte určit jednotlivé revize, podíváme se, jak lze určovat celé intervaly revizí.

source: Now that you have Git on your system, you'll want to do a few things to customize your Git environment.
cs: Nyní, když máte Git nainstalovaný, budete chtít provést některá uživatelská nastavení jeho prostředí.

source: Now that you have a Subversion repository to which you have write access, you can go through a typical workflow.
cs: Nyní máte repozitář Subversion s oprávněním pro zápis, a proto se můžeme podívat na typický postup práce.

source: Now that you have a bare copy of your repository, all you need to do is put it on a server and set up your protocols.
cs: Nyní, když máte vytvořenu holou kopii repozitáře, zbývá ji už jen umístit na server a nastavit protokoly.

source: Now that you have a working repository, you can do some work on the project and push your commits back upstream, using Git effectively as a SVN client.
cs: Máte vytvořen pracovní repozitář a můžete se pustit do práce na projektu. Časem ale budete chtít odeslat revize zpět do repozitáře a použít při tom Git jako klienta SVN.

source: Now that you have an integer representation of your commit, you need a date for the commit metadata.
cs: Nyní jste označili revizi celým číslem a zbývá stanovit datum pro metadata revize.

source: Now that you have the basics of branching and merging down, what can or should you do with them?
cs: Když už máte základy větvení a slučování za sebou, jak s nimi můžete -- nebo byste měli -- pracovat?

source: Now that you have the contents of your key in Git, you can create a tag that points directly to it by specifying the new SHA-1 value that the `hash-object` command gave you:
cs: Nyní máte obsah svého klíče v systému Git a můžete vytvořit značku, která bude ukazovat přímo na něj. Zadejte proto novou hodnotu SHA-1, kterou jste získali příkazem `hash-object`:

source: Now that you know how both of these things work, it's up to you to decide which one is best for your particular situation.
cs: Když teď víte, jak oba přístupy fungují, je jen na vás, který z nich ve vaší konkrétní situaci zvolíte jako nejlepší.

source: Now that your filter is ready, you can test it by setting up a file with your `$Date$` keyword and then setting up a Git attribute for that file that engages the new filter:
cs: Nyní, když máte filtr hotový, můžete ho otestovat vytvořením souboru s klíčovým slovem `$Date$` a nastavením atributu Git pro tento soubor, jímž nový filtr aktivujete:

source: Now that your identity is set up, you can configure the default text editor that will be used when Git needs you to type in a message.
cs: Nyní, když jste zadali své osobní údaje, můžete nastavit výchozí textový editor, který se použije, když po vás Git bude chtít napsat nějakou zprávu.

source: Now that your staging area is set up the way you want it, you can commit your changes.
cs: Nyní, když jste oblast připravených změn nastavili podle svých představ, můžete začít zapisovat změny (commit).

source: Now that your work is merged in, you have no further need for the `iss53` branch.
cs: Nyní, když jste svou práci začlenili, nebudete už větev `iss53` potřebovat.

source: Now you can fast-forward your `master` branch (see <<rbdiag_g>>):
cs: Teď můžete větev `master` posunout „rychle vpřed“ (viz <<rbdiag_g, obrázek>>):

source: Now you can look at your new commit object with `cat-file`:
cs: Nyní se můžete podívat na nově vytvořený objekt revize. Použijte příkaz `cat-file`:

source: Now you can revert the file back to the first version
cs: Soubor nyní můžete vrátit do první verze:

source: Now you can see how Git has stored your data:
cs: Nyní se můžete podívat, jak Git vaše data uložil:

source: Now you can see that the TODO and index.html files are staged and the simplegit.rb file is still unstaged.
cs: Jak vidíte, soubory TODO a index.html jsou připraveny k zapsání, soubor simplegit.rb nikoli.

source: Now you can send the maintainer a message that you've made the requested changes and they can find those changes in your `featureBv2` branch.
cs: Teď už můžete správci zaslat zprávu, že jste provedli požadované změny a že je najde ve vaší větvi `featureBv2`.

source: Now you can set up your config file to use your custom merge resolution and diff tools.
cs: Nyní můžete nastavit konfigurační soubor k používání vlastních nástrojů diff a nástrojů k řešení slučování.

source: Now you can switch back to your work-in-progress branch on issue #53 and continue working on it.
cs: Teď se můžete přepnout zpět na větev s rozdělanou prací a pokračovat na problému #53.

source: Now you can use `git diff` to see what is still unstaged:
cs: Příkazem `git diff` se teď můžete podívat, co ještě není připraveno k zapsání:

source: Now you can use the string `pb` on the command line in lieu of the whole URL.
cs: Řetězec `pb` nyní můžete používat na příkazovém řádku místo kompletní adresy URL.

source: Now you get the call that there is an issue with the web site, and you need to fix it immediately.
cs: V tomto okamžiku vám zavolají, že se na webových stránkách vyskytl problém, který musíte okamžitě vyřešit.

source: Now you should have a nicer Subversion import in your `my_project` directory.
cs: Import ze systému Subversion v adresáři `my_project` by měl nyní vypadat o něco lépe.

source: Now you want to switch branches, but you don’t want to commit what you’ve been working on yet; so you’ll stash the changes.
cs: Nyní chcete přepnout na jinou větev, ale nechcete zapsat změny, na nichž jste dosud pracovali – proto změny odložíte.

source: Now you're both in a pickle.
cs: Teď jste oba v loji.

source: Now you've created your first commit!
cs: Nyní jste vytvořili svou první revizi!

source: Now your new project root is what was in the `trunk` subdirectory each time.
cs: Vaším nový kořenovým adresářem je nyní obsah podadresáře `trunk`.

source: Now your project history has diverged (see <<divergent_history>>).
cs: Nyní se historie vašeho projektu rozdělila (viz obrázek <<divergent_history>>).

source: Now you’ll explore a number of very powerful things that Git can do that you may not necessarily use on a day-to-day basis but that you may need at some point.
cs: Nyní poznáte několik velmi účinných nástrojů, které vám Git nabízí. Pravděpodobně je nebudete používat každý den, ale přesto se vám mohou čas od času hodit.

source: Now you’re on another commit, halfway between the one you just tested and your bad commit.
cs: Nyní jste na jiné revizi, na půl cesty mezi revizí, kterou jste právě otestovali, a problémovou revizí.

source: Now, Git will use the KDiff3 tool for diff viewing and merge conflict resolution.
cs: Git bude nyní k zobrazení výstupů nástoje diff a k řešení konfliktů při slučování používat nástroj KDiff3.

source: Now, Jessica can merge her topic work into her master branch, merge John's work (`origin/master`) into her `master` branch, and then push back to the server again.
cs: Teď může Jessica začlenit (merge) svou tématickou větev do své větve `master`, začlenit Johnovu práci (`origin/master`) rovněž do své větve `master` a potom vše může odeslat (push) znovu na server.

source: Now, Jessica makes a couple of commits on the `featureB` branch:
cs: Jessica nyní vytvoří několik revizí ve větvi `featureB`:

source: Now, Jessica pushes her work up to the server:
cs: Jessica teď odešle (push) svou práci na server:

source: Now, John can test his code to make sure it still works properly, and then he can push his new merged work up to the server:
cs: Teď může John svůj kód otestovat, aby se ujistil, že stále pracuje správně, a pak může odeslat svou novou sloučenou práci na server:

source: Now, all your work is on top of what is on the Subversion server, so you can successfully `dcommit`:
cs: Nyní je všechna vaše práce na vrcholu revizí, které jsou na serveru Subversion. Příkaz `dcommit` bude nyní úspěšně proveden:

source: Now, each of your topics is contained within a silo – similar to a patch queue – that you can rewrite, rebase, and modify without the topics interfering or interdepending on each other, like so:
cs: Teď je každé z vašich témat obsaženo v samostatném zásobníku -- podobá se frontě záplat -- a můžete je přepsat, přeskládat a upravit, aniž by se obě témata navzájem ovlivňovala nebo by se mezi nimi vytvářela vzájemná závislost, viz obrázek:

source: Now, if you want to merge your `opera` branch into `trunk` (your `master` branch), you can do so with a normal `git merge`.
cs: Budete-li nyní chtít začlenit větev `opera` do větve `trunk` (vaše větev `master`), můžete tak učinit běžným příkazem `git merge`.

source: Now, let's say you decide you like the second solution to your issue best (`iss91v2`); and you showed the `dumbidea` branch to your coworkers, and it turns out to be genius.
cs: Řekněme, že se nyní rozhodnete, že se vám druhé řešení problému líbí víc (`iss91v2`). Svůj nápad ve větvi `dumbidea` jste ukázali kolegům a ti ho považují za geniální.

source: Now, modify that file a little, and see what happens:
cs: Nyní soubor trochu upravíme a uvidíme, co se stane:

source: Now, move the `master` branch back to the middle commit:
cs: Nyní vrátíme větev `master` zpět na prostřední revizi:

source: Now, pay attention.
cs: A nyní pozor.

source: Now, run the `cat-file` command on that SHA-1 value:
cs: Nyní pro tuto hodnotu SHA-1 spusťte příkaz `cat-file`:

source: Now, someone else does more work that includes a merge, and pushes that work to the central server.
cs: Někdo jiný teď provede další úpravy, jejichž součástí bude i sloučení (merge), a odešle svou práci na centrální server.

source: Now, store some text in your Git database:
cs: Nyní můžete uložit kousek textu do databáze Git:

source: Now, suppose you forgot to tag the project at v1.2, which was at the ``updated rakefile'' commit.
cs: Nyní předpokládejme, že jste zapomněli označkovat projekt verze 1.2, který je zachycen revizí se zprávou „updated rakefile“.

source: Now, the snapshot pointed to by `C4'` is exactly the same as the one that was pointed to by `C5` in the merge example.
cs: Snímek, na který odkazuje `C4'`, je v tomto okamžiku přesně stejný, jako ten, na který u příkladu využívajícího slučování odkazoval `C5`.

source: Now, to the question of whether merging or rebasing is better: hopefully you'll see that it's not that simple.
cs: A teď zpět k otázce, zda je lepší slučování nebo přeskládání. Vidíte, doufám, že to není tak jednoduché.

source: Now, when someone else clones or pulls from your repository, they will get all your tags as well.
cs: Pokud nyní někdo bude klonovat nebo stahovat z vašeho repozitáře, stáhne rovněž všechny vaše značky.

source: Now, years later, I'm a contributor to a major Git implementation, I've worked for the largest Git hosting company, and I've traveled the world teaching people about Git.
cs: A teď, po několika letech, jsem přispěvatelem hlavní implementace systému Git, pracoval jsem pro největší společnost hostující Git a procestoval jsem svět, abych Git naučil další lidi.

source: Now, you can add content to Git and pull it back out again.
cs: Nyní tedy umíte vložit do systému Git určitý obsah a ten poté zase vytáhnout.

source: Now, you can run `git fetch teamone` to fetch everything the remote `teamone` server has that you don't have yet.
cs: Nyní můžete spustit příkaz `git fetch teamone`, který ze vzdáleného repozitáře `teamone` vyzvedne vše, co ještě nemáte.

source: Now, you can run `git log` to see your new history:
cs: Nyní si můžete nechat příkazem `git log` zobrazit svoji novou historii:

source: Now, you can sign tags without having to specify your key every time with the `git tag` command:
cs: Nyní můžete podepisovat značky, aniž byste museli pokaždé znovu zadávat svůj klíč příkazem `git tag`:

source: Now, you can use the `write-tree` command to write the staging area out to a tree object.
cs: Nyní můžete použít příkaz `write-tree`, jímž zapíšete stav oblasti připravovaných změn neboli indexu do objektu stromu.

source: Now, you can use the head reference you just created instead of the SHA-1 value in your Git commands:
cs: Nyní můžete v příkazech Git používat „head“ referenci, kterou jste právě vytvořili, místo hodnoty SHA-1:

source: Now, you need to make Apache use CGI for that script, for which you can add a VirtualHost:
cs: Nyní musíte zajistit, aby server Apache používal CGI pro skript, pro který můžete přidat VirtualHost:

source: Now, you need to remove this file from all trees in your past.
cs: Nyní potřebujete odstranit tento soubor ze všech minulých stromů.

source: Now, you need to set up a filter in Git (call it `dater`) and tell it to use your `expand_date` filter to smudge the files on checkout.
cs: Nyní budete muset nastavit filtr v systému Git (pojmenujte ho `dater`) a určit, aby k operaci smudge při checkoutu souborů používal filtr `expand_date`.

source: Now, your local branch `sf` will automatically pull from `origin/serverfix`.
cs: Vaše lokální větev `sf` nyní bude automaticky stahovat data (pull) z `origin/serverfix`.

source: Oddly enough, you have a real Git history now that you can view with the `git log` command, if you run it on the last commit SHA-1:
cs: Může se to zdát zvláštní, ale nyní máte vytvořenu skutečnou historii revizí Git, kterou lze zobrazit příkazem `git log` spuštěným pro hodnotu SHA-1 poslední revize:

source: Of course if you do this and do a commit, your `version2` branch will be slightly different than your `v2.0.0` tag since it will move forward with your new changes, so do be careful.
cs: Je jasné, že když teď zapíšete nějakou změnu, vaše větev `version2` se bude od snímku se značkou `v2.0.0` lišit, protože vás nové změny posunou dál. Takže buďte opatrní.

source: Of the nearly 40,000 commits in the Git source code history, this command shows the 6 that match those criteria.
cs: Z téměř 40 tisíc revizí v historii zdrojového kódu Gitu zobrazí příkaz 6 záznamů, které odpovídají zadaným kritériím.

source: Often, the quickest way is to use a tool called `git reflog`.
cs: Nejrychlejší cestou často bývá použít nástroj `git reflog`.

source: Often, when you’ve been working on part of your project, things are in a messy state and you want to switch branches for a bit to work on something else.
cs: Až budete pracovat na některé části svého projektu, často vám může připadat, že je vaše práce poněkud neuspořádaná a vy budete třeba chtít přepnout větve a pracovat na chvíli na něčem jiném.

source: Often, you'll do this to make sure your commits apply cleanly on a remote branch – perhaps in a project to which you're trying to contribute but that you don't maintain.
cs: Tuto metodu budete často používat v situaci, kdy chcete mít jistotu, že byly na vzdálenou větev vaše změny aplikovány čistě -- například u projektu, do kterého chcete přispět, ale který nespravujete.

source: Often, you'll have a class of files that you don't want Git to automatically add or even show you as being untracked.
cs: Ve vašem adresáři se často vyskytne skupina souborů, u nichž nebudete chtít, aby je Git automaticky přidával nebo aby je vůbec uváděl jako nesledované.

source: On Linux machines, `lighttpd` is often installed, so you may be able to get it to run by typing `git instaweb` in your project directory.
cs: V počítačích se systémem Linux je často nainstalován `lighttpd`. Spustit ho lze zadáním příkazu `git instaweb` v adresáři vašeho projektu.

source: On Windows systems, Git looks for the `.gitconfig` file in the `$HOME` directory (`C:\Users\$USER` for most people).
cs: Ve Windows se soubor `.gitconfig` hledá v adresáři `$HOME`{empty}footnote:[Pozn. překl.: V proměnných prostředí Windows je to `%USERPROFILE%`. Zápis `$HOME` odkazuje na odpovídající údaj v unixových systémech.] (u většiny uživatelů je to `C:\Users\$USER`{empty}footnote:[Pozn. překl.: Ve Windows odpovídá odkazu na unixovskou proměnnou `$USER` odkaz na proměnnou prostředí `%USERNAME%`]).
